Model input shape (110, 6)
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_1[0][0]                    
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_3[0][0]                    
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_2[0][0]                    
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_4[0][0]                    
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_5[0][0]                    
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_1[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_1[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 181 samples, validate on 90 samples
Epoch 1/5
181/181 [==============================] - 45s 248ms/step - loss: 1.3751 - accuracy: 0.5525 - val_loss: 0.6451 - val_accuracy: 0.6444
Epoch 2/5
181/181 [==============================] - 44s 244ms/step - loss: 0.8308 - accuracy: 0.6740 - val_loss: 0.5249 - val_accuracy: 0.8111
Epoch 3/5
181/181 [==============================] - 44s 243ms/step - loss: 0.6598 - accuracy: 0.7072 - val_loss: 0.4836 - val_accuracy: 0.8222
Epoch 4/5
181/181 [==============================] - 44s 242ms/step - loss: 0.5328 - accuracy: 0.7956 - val_loss: 0.3649 - val_accuracy: 0.9333
Epoch 5/5
181/181 [==============================] - 44s 241ms/step - loss: 0.3949 - accuracy: 0.8453 - val_loss: 0.3317 - val_accuracy: 0.8667
Saved model to disk
>#1 validation accuracy: 80.882
Model input shape (110, 6)
Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_8 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_7 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_9 (InputLayer)            (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_10 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_6[0][0]                    
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_8[0][0]                    
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_7[0][0]                    
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_9[0][0]                    
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_10[0][0]                   
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_2[0][0]                  
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_2[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 181 samples, validate on 90 samples
Epoch 1/5
181/181 [==============================] - 45s 247ms/step - loss: 1.3722 - accuracy: 0.5304 - val_loss: 0.4902 - val_accuracy: 0.7667
Epoch 2/5
181/181 [==============================] - 44s 242ms/step - loss: 0.7512 - accuracy: 0.6796 - val_loss: 0.2389 - val_accuracy: 0.9667
Epoch 3/5
181/181 [==============================] - 44s 245ms/step - loss: 0.4299 - accuracy: 0.8177 - val_loss: 0.0686 - val_accuracy: 1.0000
Epoch 4/5
181/181 [==============================] - 44s 243ms/step - loss: 0.2077 - accuracy: 0.9061 - val_loss: 0.0208 - val_accuracy: 1.0000
Epoch 5/5
181/181 [==============================] - 44s 245ms/step - loss: 0.1277 - accuracy: 0.9613 - val_loss: 0.0068 - val_accuracy: 1.0000
Saved model to disk
>#2 validation accuracy: 100.000
Model input shape (110, 6)
Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_11 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_13 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_12 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_14 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_15 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_11[0][0]                   
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_13[0][0]                   
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_12[0][0]                   
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_14[0][0]                   
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_15[0][0]                   
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_3[0][0]                  
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_3[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 181 samples, validate on 90 samples
Epoch 1/5
181/181 [==============================] - 45s 251ms/step - loss: 0.7016 - accuracy: 0.7348 - val_loss: 0.4226 - val_accuracy: 0.7778
Epoch 2/5
181/181 [==============================] - 45s 247ms/step - loss: 0.3975 - accuracy: 0.8177 - val_loss: 0.2345 - val_accuracy: 0.9444
Epoch 3/5
181/181 [==============================] - 45s 247ms/step - loss: 0.1437 - accuracy: 0.9503 - val_loss: 0.1061 - val_accuracy: 0.9667
Epoch 4/5
181/181 [==============================] - 45s 247ms/step - loss: 0.0676 - accuracy: 0.9834 - val_loss: 0.0943 - val_accuracy: 0.9556
Epoch 5/5
181/181 [==============================] - 44s 245ms/step - loss: 0.0570 - accuracy: 0.9834 - val_loss: 0.0590 - val_accuracy: 0.9667
Saved model to disk
>#3 validation accuracy: 97.059
Model input shape (110, 6)
Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_16 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_18 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_17 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_19 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_20 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_16[0][0]                   
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_18[0][0]                   
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_17[0][0]                   
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_19[0][0]                   
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_20[0][0]                   
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_4[0][0]                  
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_4[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 181 samples, validate on 90 samples
Epoch 1/5
181/181 [==============================] - 45s 246ms/step - loss: 0.9228 - accuracy: 0.6133 - val_loss: 0.3804 - val_accuracy: 0.8333
Epoch 2/5
181/181 [==============================] - 44s 245ms/step - loss: 0.5978 - accuracy: 0.7072 - val_loss: 0.3392 - val_accuracy: 0.8444
Epoch 3/5
181/181 [==============================] - 43s 240ms/step - loss: 0.3847 - accuracy: 0.8011 - val_loss: 0.3069 - val_accuracy: 0.8889
Epoch 4/5
181/181 [==============================] - 43s 240ms/step - loss: 0.2760 - accuracy: 0.8840 - val_loss: 0.2969 - val_accuracy: 0.9111
Epoch 5/5
181/181 [==============================] - 44s 241ms/step - loss: 0.2266 - accuracy: 0.9116 - val_loss: 0.2542 - val_accuracy: 0.9778
Saved model to disk
>#4 validation accuracy: 92.647
Model input shape (110, 6)
Model: "model_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_21 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_23 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_22 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_24 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
input_25 (InputLayer)           (None, 110, 6)       0                                            
__________________________________________________________________________________________________
r_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_21[0][0]                   
__________________________________________________________________________________________________
trunk_layer (SimpleRNN)         (None, 110, 2)       18          input_23[0][0]                   
__________________________________________________________________________________________________
l_arm_layer (SimpleRNN)         (None, 110, 2)       18          input_22[0][0]                   
__________________________________________________________________________________________________
r_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_24[0][0]                   
__________________________________________________________________________________________________
l_leg_layer (SimpleRNN)         (None, 110, 2)       18          input_25[0][0]                   
__________________________________________________________________________________________________
r_arm_trunk_layer (Concatenate) (None, 110, 4)       0           r_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_arm_trunk_layer (Concatenate) (None, 110, 4)       0           l_arm_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
r_leg_trunk_layer (Concatenate) (None, 110, 4)       0           r_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
l_leg_trunk_layer (Concatenate) (None, 110, 4)       0           l_leg_layer[0][0]                
                                                                 trunk_layer[0][0]                
__________________________________________________________________________________________________
upper_body_layer (Concatenate)  (None, 110, 8)       0           r_arm_trunk_layer[0][0]          
                                                                 l_arm_trunk_layer[0][0]          
__________________________________________________________________________________________________
lower_body_layer (Concatenate)  (None, 110, 8)       0           r_leg_trunk_layer[0][0]          
                                                                 l_leg_trunk_layer[0][0]          
__________________________________________________________________________________________________
full_body_layer (Concatenate)   (None, 110, 16)      0           upper_body_layer[0][0]           
                                                                 lower_body_layer[0][0]           
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 110, 16)      0           full_body_layer[0][0]            
__________________________________________________________________________________________________
relu_layer (Dense)              (None, 110, 2)       34          dropout_5[0][0]                  
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 220)          0           relu_layer[0][0]                 
__________________________________________________________________________________________________
softmax_layer (Dense)           (None, 2)            442         flatten_5[0][0]                  
==================================================================================================
Total params: 566
Trainable params: 566
Non-trainable params: 0
__________________________________________________________________________________________________
None
Train on 181 samples, validate on 90 samples
Epoch 1/5
181/181 [==============================] - 43s 239ms/step - loss: 1.1723 - accuracy: 0.5912 - val_loss: 0.5958 - val_accuracy: 0.7222
Epoch 2/5
181/181 [==============================] - 43s 235ms/step - loss: 0.8660 - accuracy: 0.6906 - val_loss: 0.4959 - val_accuracy: 0.9000
Epoch 3/5
181/181 [==============================] - 43s 238ms/step - loss: 0.5839 - accuracy: 0.7459 - val_loss: 0.4970 - val_accuracy: 0.9111
Epoch 4/5
181/181 [==============================] - 43s 238ms/step - loss: 0.4901 - accuracy: 0.7901 - val_loss: 0.4452 - val_accuracy: 0.9333
Epoch 5/5
181/181 [==============================] - 43s 235ms/step - loss: 0.4751 - accuracy: 0.8453 - val_loss: 0.4192 - val_accuracy: 0.9111
Saved model to disk
>#5 validation accuracy: 86.765
[80.88235259056091, 100.0, 97.0588207244873, 92.64705777168274, 86.76470518112183]
Accuracy: 91.471% (+/-6.923)
CPU times: user 40min 39s, sys: 7min 45s, total: 48min 24s
Wall time: 18min 45s
